SoapThrower/BAD/NewFile.xml


Sent XML=
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<S:Header>
		<ns1:RequestHeader xmlns:ns1="http://dom.gosuslugi.ru/schema/integration/base/"
			xmlns:ns2="http://www.w3.org/2000/09/xmldsig#" xmlns:ns3="http://dom.gosuslugi.ru/schema/integration/services/"
			xmlns:ns4="http://dom.gosuslugi.ru/schema/integration/nsi-base/"
			xmlns:ns5="http://dom.gosuslugi.ru/schema/integration/organizations-registry-base/"
			xmlns:ns6="http://dom.gosuslugi.ru/schema/integration/nsi-common/">
			<ns1:Date>2016-12-20T13:21:48.526+07:00</ns1:Date>
			<ns1:MessageGUID>57d4cd8e-3eab-4572-82a8-9c9ce4fecc56
			</ns1:MessageGUID>
			<ns1:orgPPAGUID>b9fe4d27-020d-44dc-8bfd-b5972a504f45</ns1:orgPPAGUID>
			<ns1:IsOperatorSignature>true</ns1:IsOperatorSignature>
		</ns1:RequestHeader>
	</S:Header>
	<S:Body>
		<ns6:exportNsiItemRequest
			xmlns:ns6="http://dom.gosuslugi.ru/schema/integration/nsi-common/"
			xmlns:ns1="http://dom.gosuslugi.ru/schema/integration/base/"
			xmlns:ns2="http://www.w3.org/2000/09/xmldsig#" xmlns:ns3="http://dom.gosuslugi.ru/schema/integration/services/"
			xmlns:ns4="http://dom.gosuslugi.ru/schema/integration/nsi-base/"
			xmlns:ns5="http://dom.gosuslugi.ru/schema/integration/organizations-registry-base/"
			Id="foo" ns1:version="10.0.1.2">
			<ns6:RegistryNumber>268</ns6:RegistryNumber>
			<ns4:ListGroup>NSI</ns4:ListGroup>
		</ns6:exportNsiItemRequest>
	</S:Body>
</S:Envelope>
13:21:48.864 [main] INFO com.ric.st.impl.LoggingSOAPHandler 